# 01 - Basic of Pandas
 - [Install Pandas](#install_pandas) 
 - [Import Pandas](#import_pandas)
 - [How to check Shape](#how_to_check_shape)
 - Check Datatype

## <a id='install_pandas'>Install Pandas</a>

In [1]:
!pip install pandas

Requirement already satisfied: pandas in ./.venv/lib/python3.11/site-packages (2.2.2)
Requirement already satisfied: numpy>=1.23.2 in ./.venv/lib/python3.11/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.11/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.venv/lib/python3.11/site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in ./.venv/lib/python3.11/site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

## <a id='import_pandas'>Import Pandas</a>

In [2]:
import pandas as pd

## Check Pandas version

In [3]:
pd.__version__

'2.2.2'

## How to create Series

In [4]:
df = pd.Series([1,2,3,4,5])
df

0    1
1    2
2    3
3    4
4    5
dtype: int64

## <a id='how_to_check_shape'>How to check Shape</a>

In [5]:
df.shape

(5,)

## How to create DataFrame

In [6]:
df = pd.DataFrame(
    {
        "firstName": ["Jane", "Jake", "Ben", "Aaron", "Jim", "Mark", "Vimal", "Jane", "Jack"],
        "lastName": ["Smith", "Doe", "Lee", "White", "Matthew", "Ng", "Menon", "Doe", "Smith"],
        "age":[25, 28, 29, 35, 33, 45, 40, 22, 30],
        "country":["USA", "USA", "China", "Hong Kong", "India", "China", "Hong Kong", "UK", "Spain"],
        "sex": ["Male", "Male", "Male", "Male", "Male", "Male", "Male", "Female", "Male"]
    }
)
df

  firstName lastName  age    country     sex
0      Jane    Smith   25        USA    Male
1      Jake      Doe   28        USA    Male
2       Ben      Lee   29      China    Male
3     Aaron    White   35  Hong Kong    Male
4       Jim  Matthew   33      India    Male
5      Mark       Ng   45      China    Male
6     Vimal    Menon   40  Hong Kong    Male
7      Jane      Doe   22         UK  Female
8      Jack    Smith   30      Spain    Male

## How to check Shape

In [7]:
df.shape

(9, 5)

## How to get Info

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   firstName  9 non-null      object
 1   lastName   9 non-null      object
 2   age        9 non-null      int64
 3   country    9 non-null      object
 4   sex        9 non-null      object
dtypes: int64(1), object(4)
memory usage: 492.0+ bytes

## How to use describe

In [9]:
df.describe()

             age
count   9.000000
mean   31.888889
std     7.253352
min    22.000000
25%    28.000000
50%    30.000000
75%    35.000000
max    45.000000

## How to get columns

In [10]:
df.columns

Index(['firstName', 'lastName', 'age', 'country', 'sex'], dtype='object')

In [11]:
df.keys()

Index(['firstName', 'lastName', 'age', 'country', 'sex'], dtype='object')

In [12]:
df.axes

[RangeIndex(start=0, stop=9, step=1),
 Index(['firstName', 'lastName', 'age', 'country', 'sex'], dtype='object')]

## How to get Index

In [13]:
df.index

RangeIndex(start=0, stop=9, step=1)

## Check Datatype for each column

In [14]:
df.dtypes

firstName    object
lastName     object
age           int64
country      object
sex          object
dtype: object

## Check the dimension

In [15]:
df.ndim

2

## Get top data

In [16]:
df.head(3)

  firstName lastName  age country   sex
0      Jane    Smith   25     USA  Male
1      Jake      Doe   28     USA  Male
2       Ben      Lee   29   China  Male

## Get last data

In [17]:
df.tail(3)

  firstName lastName  age    country     sex
6     Vimal    Menon   40  Hong Kong    Male
7      Jane      Doe   22         UK  Female
8      Jack    Smith   30      Spain    Male

## Get Memory Usage

In [19]:
df["firstName"].memory_usage(index=False)

72

TypeError: NDFrame.first() missing 1 required positional argument: 'offset'